In [1]:
# import library
import pandas as pd
import numpy as np

In [2]:
# Create DataFrame
st_marks={"Roll_No":[101,"#",103,104,102,105],
          "Name":["Kartik","Abhishek","Sandeep","Rohit","Abhishek","Rohit"],
          "Python":[67,65,54,"6#",65,69]}
df=pd.DataFrame(st_marks)
df

  Roll_No      Name Python
0     101    Kartik     67
1       #  Abhishek     65
2     103   Sandeep     54
3     104     Rohit     6#
4     102  Abhishek     65
5     105     Rohit     69

In [3]:
# replace # with 102
df["Roll_No"].replace("#","102",inplace=True)
# replace 6# with nan value
df["Python"].replace("6#",np.nan,inplace=True)
# replace nan with mean of Python Column 
df["Python"].replace(np.nan,df["Python"].mean(),inplace=True)

In [4]:
df.head()

  Roll_No      Name  Python
0     101    Kartik    67.0
1     102  Abhishek    65.0
2     103   Sandeep    54.0
3     104     Rohit    64.0
4     102  Abhishek    65.0

In [5]:
# check Data Type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll_No  6 non-null      object
 1   Name     6 non-null      object
 2   Python   6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 276.0+ bytes

In [6]:
# change Data Type
df["Roll_No"]=df["Roll_No"].astype("int64")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll_No  6 non-null      int64
 1   Name     6 non-null      object
 2   Python   6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 276.0+ bytes